export const popupContent = {
    request: {
      title: 'По вашему запросу репетиторы не найдены',
      text: 'Вы можете оставить заявку, и мы поищем репетитора под ваш запрос в нашей дополнительной базе. Отправить заявку?',
      confirmButtonText: 'Да',
      cancelButtonText: 'Нет',
      color: 'white'
    },
    notFound: {
      title: 'Вы откликнулись!',
      text: 'Отклик отправлен успешно! \nКогда преподаватель примет заявку, мы обменяем \nВас контактами в Telegram, уведомление придёт автоматически через бота. \nОтменить или посмотреть статус заявки можно \nв разделе "Мои заявки".',
      confirmButtonText: 'Мои заявки',
      cancelButtonText: null,
      color: 'purple'
    }
  };