import { TData } from './types';

export const subjects: TData = [
  'Все',
  'Математика',
  'Русский язык',
  'Физика',
  'Биология',
  'Химия',
  'Литература',
  'Обществознание',
  'Окружающий мир',
  'География',
  'История'
];

export const foreignLanguages: TData = [
  'Английский',
  'Немецкий',
  'Французский',
  'Испанский',
  'Итальянский',
  'Китайский',
  'Японский',
  'Португальский',
  'Сербский',
  'Турецкий',
  'Корейский',
  'Русский для иностранцев',
  'Азербайджанский',
  'Финский',
  'Арабский'
];

export const speechTherapy: TData = ['Детский логопед', 'Взрослый логопед'];

export const others: TData = [
  'Подготовка к школе',
  'Начальная школа',
  'Компьютерная грамотность',
  'Финансовая грамотность'
];

export const goals: TData = [
  'Подготовка к ВПР',
  'Подготовка к ОГЭ',
  'Подготовка к ЕГЭ',
  'Подготовка к олимпиаде',
  'Повышение успеваемости',
  'Подготовка к экзамену'
];

export const ageBrackets: TData = [
  'Все',
  'Дошкольник',
  '1-4 класс',
  '5-8 класс',
  '9-11 класс',
  'Студент',
  'Взрослый'
];

export const experience: TData = [
  'до года',
  '1-5 лет',
  '5-10 лет',
  'Более 10 лет'
];

export const gender: TData = ['Все', 'Мужчина', 'Женщина'];

export const rating: TData = ['Все', 'Высокий', 'Средний', 'Низкий'];

export const option: TData = ['C видеопрезентацией'];
