export const titles = {
  subjects: 'Предметы',
  schoolSubjects: 'Школьные предметы',
  foreignLanguage: 'Иностранные языки',
  speechTherapy: 'Логопедия',
  others: 'Другие репетиторы',
  goals: 'Цели',
  ageBracket: 'Возрастная категория',
  price: 'Цена',
  experience: 'Опыт',
  gender: 'Пол',
  rating: 'Рейтинг',
  option: 'Другое'
};

export const subjects = [
  'Все',
  'Математика',
  'Русский язык',
  'Физика',
  'Биология',
  'Химия',
  'Литература',
  'Обществознание',
  'Окружающий мир',
  'География',
  'История'
];

export const foreignLanguages = [
  'Английский',
  'Немецкий',
  'Французский',
  'Испанский',
  'Итальянский',
  'Китайский',
  'Японский',
  'Португальский',
  'Сербский',
  'Турецкий',
  'Корейский',
  'Русский для иностранцев',
  'Азербайджанский',
  'Финский',
  'Арабский'
];

export const speechTherapy = ['Детский логопед', 'Взрослый логопед'];

export const others = [
  'Подготовка к школе',
  'Начальная школа',
  'Компьютерная грамотность',
  'Финансовая грамотность'
];

export const goals = [
  'Подготовка к ВПР',
  'Подготовка к ОГЭ',
  'Подготовка к ЕГЭ',
  'Подготовка к олимпиаде',
  'Повышение успеваемости',
  'Подготовка к экзамену'
];

export const ageBrackets = [
  'Все',
  'Дошкольник',
  '1-4 класс',
  '5-8 класс',
  '9-11 класс',
  'Студент',
  'Взрослый'
];

export const experience = ['до года', '1-5 лет', '5-10 лет', 'Более 10 лет'];

export const gender = ['Все', 'Мужчина', 'Женщина'];

export const rating = ['Все', 'Высокий', 'Средний', 'Низкий'];

export const option = ['c видеопрезентацией'];
