export const bonusPopupData: {
    title: string
    text: string
    buttonText: string
    URL: string
    points: number
} = {
    title: 'Бонусная программа',

    text: 
    `
        Зачем получать баллы?
        Баллы можно обменять на денежное вознаграждение

        Как пригласить ученика?
        Скопируйте реферальную ссылку и отправьте ученику. Он должен указать ссылку при регистрации

        Как обменять баллы на денежное вознаграждение?
        Когда вы накопите 500 баллов, на этом экране появится кнопка “Вывести баллы”. Нажав на неё, вы перейдёте в чат с нашим менеджером. Он отправит деньги вам на карту

        За что начисляются баллы?
        Если вы пригласили в приложение ученика, и ученик прошёл 5 занятий с другим репетитором, вы получаете баллы.  
        1 занятие = 100 баллов
    `,

    buttonText: 'Вывести баллы',
    URL: 'https://www.figma.com/design222gyrtrfggggggggggg',
    points: 500
}

export const reviewPopupData: {
    title: string
    text: string
    buttonText: string
} = {
    title: 'Перенос отзывов',

    text: 
    `
        Как перенести отзывы с других платформ?
        Вы можете перенести до 10 верифицированных отзывов с других платформ (профи, авито, и тд).

        Зачем это делать?
        Наличие отзывов повышает доверие у учеников, помогает увеличить количество запросов и быстрее заполнить ваше расписание уроками с новыми учениками.

        Как это работает?
        Прикрепите ссылки на свои анкеты в других сервисах, где есть отзывы о ваших уроках. Мы их проверим и перенесем на нашу платформу.
    `,

    buttonText: 'Отправить'
}