import { TInputData } from './types';

const authInputsData: TInputData = {
  name: [
    'name',
    'Введите имя',
    'Имя',
    'Имя должно содержать только буквы',
    '^[А-ЯЁа-яё]+(?:[ \\-][А-ЯЁа-яё]+)*$'
  ],
  tg: [
    'tg',
    '@aleksandr',
    'Никнейм в Telegram',
    'Никнейм должен состоять из латинских букв',
    '^[a-zA-Z0-9_]+$'
  ],

  link: [
    'link',
    'https://...',
    'Реферальная ссылка (при наличии)',
    'Некорректный формат ссылки',
    '^(?:(?:https?|ftp):\/\/)?(?:(?!(?:10|127)(?:\.\d{1,3}){3})(?!(?:169\.254|192\.168)(?:\.\d{1,3}){2})(?!172\.(?:1[6-9]|2\d|3[0-1])(?:\.\d{1,3}){2})(?:[1-9]\d?|1\d\d|2[01]\d|22[0-3])(?:\.(?:1?\d{1,2}|2[0-4]\d|25[0-5])){2}(?:\.(?:[1-9]\d?|1\d\d|2[0-4]\d|25[0-4]))|(?:(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)(?:\.(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)*(?:\.(?:[a-z\u00a1-\uffff]{2,})))(?::\d{2,5})?(?:\/\S*)?$'
  ],
  code: [
    'code',
    'Введите шестизначное число',
    'Код',
    'Введите шестизначный код',
    '^\\d{6}$'
  ]
};

export default authInputsData;
