import { ServicesListItem } from "./type"

export const textContent: string = 
`
    Опытный репетитор, выпускник КубГУ. Индивидуальный подход: Каждый ученик уникален,
    и я адаптирую свои методы обучения под конкретные потребности, интересы и цели.
    Мы сможем работать над теми предметами, которые вызывают наибольшие трудности,
    или расширить знания в уже освоенных областях. Разнообразные методики:
    Использую современные методики и технологии, чтобы сделать процесс обучения увлекательным и продуктивным.
    Это могут быть интерактивные задания, видеоматериалы и игры. Я стремлюсь создать атмосферу,
    в которой ваш ребенок сможет не просто учиться, но и получать удовольствие от процесса.
    Подготовка к экзаменам: Если ваш ребенок готовится к важным экзаменам, я предлагаю комплексную подготовку,
    включающую разбор пробных тестов, изучение типов заданий и управление временем в условиях экзамена.
    Поддержка и мотивация: Я не только обучаю, но и поддерживаю своих учеников,
    помогая им развивать уверенность в себе и свои способности. Верю, что позитивное отношение к учебе
     — это залог успеха.Подхожу к каждому ученику индивидуально и использую современные методики обучения.
`

export const servicesList: ServicesListItem[] = [
    {
        service: "Школьники с 1 по 4 класс",
        price: 1200
    },
    {
        service: "Школьники с 5 по 8 класс",
        price: 1500
    },
    {
        service: "Подготовка к ОГЭ",
        price: 1700
    },
    {
        service: "Подготовка к ЕГЭ",
        price: 2000
    }
];
