export const textContent: string = 
`
    Опытный репетитор, выпускник КубГУ. Индивидуальный подход: Каждый ученик уникален,
    и я адаптирую свои методы обучения под конкретные потребности, интересы и цели.
    Мы сможем работать над теми предметами, которые вызывают наибольшие трудности,
    или расширить знания в уже освоенных областях. Разнообразные методики:
    Использую современные методики и технологии, чтобы сделать процесс обучения увлекательным и продуктивным.
    Это могут быть интерактивные задания, видеоматериалы и игры. Я стремлюсь создать атмосферу,
    в которой ваш ребенок сможет не просто учиться, но и получать удовольствие от процесса.
    Подготовка к экзаменам: Если ваш ребенок готовится к важным экзаменам, я предлагаю комплексную подготовку,
    включающую разбор пробных тестов, изучение типов заданий и управление временем в условиях экзамена.
    Поддержка и мотивация: Я не только обучаю, но и поддерживаю своих учеников,
    помогая им развивать уверенность в себе и свои способности. Верю, что позитивное отношение к учебе
     — это залог успеха.Подхожу к каждому ученику индивидуально и использую современные методики обучения.
`

type ServicesListItem = {
    [key: string]: number
}

export const servicesList: ServicesListItem = {
    "Школьники с 1 по 4 класс": 1200,
    "Школьники с 5 по 8 класс": 1500,
    "Подготовка к ОГЭ": 1700,
    "Подготовка к ЕГЭ": 2000
}